OpenFOAM-v2112-AD/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<constant>/caseSettings"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $:innerInlet.epsilon;

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $:innerInlet.epsilon;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $:outerInlet.epsilon;
    }

    outlet
    {
        $:outlet.epsilon;
    }

    staticWalls
    {
        $:wall.epsilon;
    }

    movingWalls
    {
        $staticWalls;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
